nxp-mcuxpresso/mcux-soc-svd/MCXN246/MCXN246.xml
        <register>
          <name>OSCCTLA</name>
          <description>Oscillator Control A</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSC_EN</name>
              <description>Crystal Oscillator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_BYP_EN</name>
              <description>Crystal Oscillator Bypass Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Does not bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COARSE_AMP_GAIN</name>
              <description>Amplifier gain adjustment bits to allow the use of a wide range of external crystal ESR values See the device datasheet for the ranges supported by this device</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN05</name>
                  <description>ESR Range 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN10</name>
                  <description>ESR Range 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN18</name>
                  <description>ESR Range 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN33</name>
                  <description>ESR Range 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_SEL_EN</name>
              <description>Crystal Load Capacitance Selection Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTAL_CAP_SEL</name>
              <description>Crystal Load Capacitance Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL0</name>
                  <description>0 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL2</name>
                  <description>2 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL4</name>
                  <description>4 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL6</name>
                  <description>6 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL8</name>
                  <description>8 pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL10</name>
                  <description>10 pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL12</name>
                  <description>12 pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL14</name>
                  <description>14 pF</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL16</name>
                  <description>16 pF</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL18</name>
                  <description>18 pF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL20</name>
                  <description>20 pF</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL22</name>
                  <description>22 pF</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL24</name>
                  <description>24 pF</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL26</name>
                  <description>26 pF</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL28</name>
                  <description>28 pF</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL30</name>
                  <description>30 pF</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_CAP_SEL</name>
              <description>Crystal Load Capacitance Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL0</name>
                  <description>0 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL2</name>
                  <description>2 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL4</name>
                  <description>4 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL6</name>
                  <description>6 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL8</name>
                  <description>8 pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL10</name>
                  <description>10 pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL12</name>
                  <description>12 pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL14</name>
                  <description>14 pF</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL16</name>
                  <description>16 pF</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL18</name>
                  <description>18 pF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL20</name>
                  <description>20 pF</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL22</name>
                  <description>22 pF</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL24</name>
                  <description>24 pF</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL26</name>
                  <description>26 pF</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL28</name>
                  <description>28 pF</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL30</name>
                  <description>30 pF</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE_EN</name>
              <description>Mode Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Startup mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Low power mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPPLY_DET</name>
              <description>Supply Detector Trim</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPLY_DET_0</name>
                  <description>VBAT supply is less than 3V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_DET_1</name>
                  <description>VBAT supply is greater than 3V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCTLB</name>
          <description>Oscillator Control B</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INVERSE</name>
              <description>Inverse Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCFGA</name>
          <description>Oscillator Configuration A</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP_TRIM</name>
              <description>Comparator Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMP_TRIM_0</name>
                  <description>760 mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP_TRIM_1</name>
                  <description>770 mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP_TRIM_3</name>
                  <description>740 mV</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP2_TRIM</name>
              <description>CAP2_TRIM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_TRIM</name>
              <description>Delay Trim</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLY_TRIM_0</name>
                  <description>P current 9(nA) and N Current 6(nA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_TRIM_1</name>
                  <description>P current 13(nA) and N Current 6(nA)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_TRIM_3</name>
                  <description>P current 4(nA) and N Current 6(nA)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_TRIM_4</name>
                  <description>P current 9(nA) and N Current 4(nA)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_TRIM_5</name>
                  <description>P current 13(nA) and N Current 4(nA)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_TRIM_7</name>
                  <description>P current 4(nA) and N Current 4(nA)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_TRIM_8</name>
                  <description>P current 9(nA) and N Current 2(nA)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_TRIM_9</name>
                  <description>P current 13(nA) and N Current 2(nA)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_TRIM_11</name>
                  <description>P current 4(nA) and N Current 2(nA)</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_TRIM</name>
              <description>Capacitor Trim</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0</name>
                  <description>Default (when CAP2_TRIM = 0 and CAP_TRIM[1:0] = 00 )</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1</name>
                  <description>-1us (when CAP2_TRIM = 0 and CAP_TRIM[1:0] = 01)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL2</name>
                  <description>-2us (when CAP2_TRIM = 0 and CAP_TRIM[1:0] = 10) or or +3.5us (when CAP2_TRIM = 1 and CAP_TRIM[1:0] = 10)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL3</name>
                  <description>-2.5us (when CAP2_TRIM = 0 and CAP_TRIM[1:0] = 11) or +1us (when CAP2_TRIM = 1 and CAP_TRIM[1:0] = 11)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INIT_TRIM</name>
              <description>Initialization Trim</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL0</name>
                  <description>8 s</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL1</name>
                  <description>4 s</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL2</name>
                  <description>2 s</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL3</name>
                  <description>1 s</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL4</name>
                  <description>0.5 s</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL5</name>
                  <description>0.25 s</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL6</name>
                  <description>0.125 s</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL7</name>
                  <description>0.5 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCFGB</name>
          <description>Oscillator Configuration B</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INVERSE</name>
              <description>Inverse Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCLCKA</name>
          <description>Oscillator Lock A</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Do not block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Block</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCLCKB</name>
          <description>Oscillator Lock B</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Do not block</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCLKE</name>
          <description>Oscillator Clock Enable</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKE</name>
              <description>Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
